
#Область ОбработчикиСобытий

// Код процедур и функций

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "Запись") Тогда
		ИдентификаторСообщения = ПараметрыВыполненияКоманды.Источник.Запись.ИдентификаторСообщения;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник.Элементы, "Список") Тогда
		
		ЭлементыФормы = ПараметрыВыполненияКоманды.Источник.Элементы;
		Список = ЭлементыФормы.Список;
		
		ИдентификаторСообщения = Новый Массив;
		Для Каждого Строка Из Список.ВыделенныеСтроки Цикл
			ИдентификаторСообщения.Добавить(Список.ДанныеСтроки(Строка).ИдентификаторСообщения);
		КонецЦикла;
		
	КонецЕсли;
	
	Отбор.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.рдв_СообщенияИнтеграции.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
