#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПредопределенныеДанные

// Получает предопредлеленный элемент
// 
// Параметры:
//  ИмяПредопределенного - Строка - 
// 
// Возвращаемое значение:
//  Произвольный - Предопределенный
//
Функция Предопределенный(ИмяПредопределенного, ВызыватьИсключение=Ложь) Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенный(ОбъектМетаданных, ИмяПредопределенного, ВызыватьИсключение);
	
КонецФункции

// Получает все предопредлеленные элементы
// 
// 
// Возвращаемое значение:
//  Структура - Элементы
//
Функция Предопределенные() Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенные(ОбъектМетаданных);
	
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидСообщения(ИмяВидаСообщения) Экспорт
	
	Если ПустаяСтрока(ИмяВидаСообщения) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	НайденныйВидЗапроса = НайтиПоРеквизиту("ИмяВидаСообщения", ИмяВидаСообщения);
	Если ЗначениеЗаполнено(НайденныйВидЗапроса) Тогда
		Возврат НайденныйВидЗапроса;
	КонецЕсли;
	
	НовыйВидЗапроса = СоздатьЭлемент();
	НовыйВидЗапроса.Наименование = ИмяВидаСообщения;
	НовыйВидЗапроса.ИмяВидаСообщения = ИмяВидаСообщения;
	НовыйВидЗапроса.ЗаписыватьДанныеСообщений = Истина;
	НовыйВидЗапроса.УстановитьНовыйКод();
	НовыйВидЗапроса.Записать();
	
	Возврат НовыйВидЗапроса.Ссылка;
	
КонецФункции

Функция РазмерПорции(ВыгружаемыйОбъект) Экспорт
	
	Порция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыгружаемыйОбъект, "РазмерПорцииДляВыгрузки");
	Возврат Порция;
	
КонецФункции

#КонецОбласти

#КонецЕсли

