// Инициализирует правила конвертации для выгрузки и загрузки.
//
// Параметры:
//  НаправлениеОбмена - Строка - "Отправка" или "Получение".
//
// Возвращаемое значение:
//  ТаблицаЗначений с правилами конвертации.
//
Функция ИнициализироватьПравилаКонвертации(НаправлениеОбмена) Экспорт
	
	СвойстваКонвертации = СвойстваКонвертации();
	
	рдв_МенеджерОбменаПереопределяемый.ЗаполнитьПравилаКонвертацииОбъектов(СвойстваКонвертации, НаправлениеОбмена);
	
	Возврат СвойстваКонвертации.ПравилаКонвертации;
	
КонецФункции

// Инициализирует таблицы для заполнения правил конвертации.
//
// Параметры:
//  НаправлениеОбмена - Строка - "Отправка" или "Получение".
//
// Возвращаемое значение:
//  Структура свойств правилам конвертации.
//
Функция СвойстваКонвертации() 

	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("МетаданныеОбъекта");
	ПравилаКонвертации.Колонки.Добавить("ИмяОбъекта");
	ПравилаКонвертации.Колонки.Добавить("ИмяПКО");
	ПравилаКонвертации.Колонки.Добавить("КонвертацияШапки");
	ПравилаКонвертации.Колонки.Добавить("КонвертацияТабличныхЧастей");
	ПравилаКонвертации.Колонки.Добавить("ПоляПоиска");
	
	КонвертацияСвойств = Новый ТаблицаЗначений;
	КонвертацияСвойств.Колонки.Добавить("ИмяРеквизита");
	КонвертацияСвойств.Колонки.Добавить("ИмяКлючаФормата");
	КонвертацияСвойств.Колонки.Добавить("Обязательный");
	КонвертацияСвойств.Колонки.Добавить("ИмяПКО");
	
	КонвертацияТабличныхЧастей = Новый ТаблицаЗначений;
	КонвертацияТабличныхЧастей.Колонки.Добавить("ИмяТабличнойЧасти");
	КонвертацияТабличныхЧастей.Колонки.Добавить("ИмяКлючаФормата");
	КонвертацияТабличныхЧастей.Колонки.Добавить("КонвертацияСвойств");
	
	СвойстваКонвертации = Новый Структура;
	СвойстваКонвертации.Вставить("ПравилаКонвертации", ПравилаКонвертации);
	СвойстваКонвертации.Вставить("ШаблонКонвертацииСвойств", КонвертацияСвойств);
	СвойстваКонвертации.Вставить("ШаблонКонвертацииТабличныхЧастей", КонвертацияТабличныхЧастей);
	
	Возврат СвойстваКонвертации;
	
КонецФункции

// Имя текущей ИБ.
// 
// Возвращаемое значение:
//  Строка - 
Функция ИмяИБ() Экспорт

	Возврат рдв_МенеджерОбменаПереопределяемый.ИмяИБ();
	
КонецФункции
