
#Область ПрограммныйИнтерфейс

// Предоставляет общий модуль для выполнения операций конкретной интеграции
// Определяет тип внешней системы (HTTP сервис или RMQ и прочее)
//
// Параметры:
//  ТипВнешнейСистемы - ПеречислениеСсылка.рдв_ТипыВнешнихСистем - тип интеграции
//  ИдентификаторСообщения - Неопределено, Строка - Идентификатор конкретного сообщения для отправки
//
// Возвращаемое значение:
//   Неопределено - 
//   ОбщийМодуль - модуль интеграции
//
Функция МодульРаботыСВнешнейСистемойПоТипу(ТипВнешнейСистемы) Экспорт
	
	
	
КонецФункции

#КонецОбласти
