
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		
	Если Форма.Объект.Ссылка = ПланыВидовХарактеристик.рдв_НастройкиПрограммы.ПустаяСсылка() Тогда
		
	// Можно задать вид значенния в зависимости от настройки
		
	Иначе
		
		// Первоначальное заполнение
		Если Не ЗначениеЗаполнено(Форма.Объект.ВидЗначения) Тогда
			Форма.Объект.ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередИнтерактивнойЗаписюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
КонецПроцедуры

Процедура ПриИнтерактивнойЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	

	
КонецПроцедуры

Процедура ПослеИнтерактивнойЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
КонецПроцедуры

#КонецОбласти 

 
#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеНастройки(ИмяНастройки, ПроверятьЗаполнение = Истина, ОбязательноеЗаполнение = Ложь) Экспорт
	
	Возврат ПланыВидовХарактеристик.рдв_НастройкиПрограммы.ЗначениеНастройки(ИмяНастройки,
	                                                                         ПроверятьЗаполнение,
	                                                                         ОбязательноеЗаполнение);
	
КонецФункции


#КонецОбласти 

