// Конвертирует структуру в текст сообщения в формате json.
//
// Параметры:
//  Структура - Структура - Структура, содержащая выгружаемые данные.
//
// Возвращаемое значение:
//  Текст сообщения обмена.
//
Функция СформироватьТекстСообщения(Структура) Экспорт

	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Структура, НастройкиСериализации);
	Возврат Запись.Закрыть();
	
КонецФункции

// Конвертирует текст сообщения в формате json в структуру.
//
// Параметры:
//  Текст сообщения обмена.
//
// Возвращаемое значение:
//  Структура - Структура - Структура, содержащая выгружаемые данные.
//
Функция ПрочитатьТекстСообщения(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	Структура = ПрочитатьJSON(Чтение);
	Возврат Структура;
	
	
КонецФункции
