
#Область ПрограммныйИнтерфейс

// Контролировать целостность данных.
// 
// Возвращаемое значение:
//  Булево - Контролировать целостность данных
Функция КонтролироватьЦелостностьДанных() Экспорт
	
	Значение = Константы.рдв_ФормироватьХешОбъектов.Получить();
	
	Возврат Значение;
	
КонецФункции

Функция ИнициализироватьПравилаРасчетаХеша() Экспорт
	
	Возврат рдв_ФормированиеХешейОбъектов.ИнициализироватьПравилаРасчетаХеша();
	
КонецФункции

Функция ИсточникИспользуетсяВИнтеграции(ПолноеИмяОбъектаМетаданных) Экспорт
	
	МетаданныеВыгружаемогоОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	ПравилаКонвертацииОбъекта = рдв_МенеджерОбмена.ПравилаКонвертацииОбъекта(МетаданныеВыгружаемогоОбъекта, "Отправка");
	Если ПравилаКонвертацииОбъекта = Неопределено Тогда
		ПравилаКонвертацииОбъекта = рдв_МенеджерОбмена.ПравилаКонвертацииОбъекта(МетаданныеВыгружаемогоОбъекта, "Получение");
	КонецЕсли;
	
	Используется = Не ПравилаКонвертацииОбъекта = Неопределено;
	
	Возврат Используется;
	
КонецФункции

#КонецОбласти
