Функция ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект) Экспорт
	
	ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.рдв_СообщенияОбмена.СоздатьМенеджерЗаписи();
	Запись.ВидСообщения = Перечисления.рдв_ВидыСообщенийОбмена.Исходящее;
	Запись.ДатаРегистрацииВМиллисекундах = ТекущаяДатаВМиллисекундах;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	Запись.ДатаРегистрации = ТекущаяДата;
	Запись.Статус = Перечисления.рдв_СтатусыСообщенийОбмена.Новое;
	
	Запись.Записать();
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

Процедура ОбновитьСтатусСообщения(ИдентификаторСообщения, Статус, ТекстСообщения = "", ТекстОшибки = "") Экспорт
	
	НачатьТранзакцию();

	Попытка;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.рдв_СообщенияОбмена");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();	
		
		НаборЗаписей = РегистрыСведений.рдв_СообщенияОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Запись.Статус = Статус;
			Запись.ТекстСообщения = ТекстСообщения;
			Запись.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры

