Функция ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект, ПравилоРегистрации, ИдентификаторСобытия = Неопределено) Экспорт
	
	ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	Если ИдентификаторСобытия = Неопределено Тогда
		ИдентификаторСобытия = ИдентификаторСообщения;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьМенеджерЗаписи();
	Запись.ДатаРегистрацииВМиллисекундах = ТекущаяДатаВМиллисекундах;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ИдентификаторСобытия = ИдентификаторСобытия;
	Запись.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	Запись.ДатаРегистрации = ТекущаяДата;
	Запись.Статус = Перечисления.рдв_СтатусыРегистрацииИзменений.Новое;
	Запись.ВнешняяСистема = ПравилоРегистрации.ВнешняяСистема;
	Запись.АдресМетода = ПравилоРегистрации.АдресМетода;
	Запись.Интерфейс = ПравилоРегистрации.Интерфейс;
	Запись.ВидСообщения = ПравилоРегистрации.ВидСообщения;
	
	Запись.Записать();
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

Процедура ОбновитьСтатусРегистрации(ИдентификаторСообщения, Статус, ТекстОшибки = "") Экспорт
	
	НачатьТранзакцию();

	Попытка;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.рдв_РегистрацияИзменений");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторСообщения", ИдентификаторСообщения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();	
		
		НаборЗаписей = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			Запись = НаборЗаписей[0];
			Запись.Статус = Статус;
			Запись.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры

Процедура УдалитьРегистрацию(ИдентификаторСообщения, ВыгружаемыйОбъект) Экспорт

	НачатьТранзакцию();
	Попытка;
		НаборЗаписей = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		НаборЗаписей.Записать();
		УдаляемыйОбъект = ВыгружаемыйОбъект.ПолучитьОбъект();
		УдаляемыйОбъект.Удалить();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры
