#Область ПрограммныйИнтерфейс

// Заполняет правила конвертации для выгрузки и загрузки.
//
// Параметры:
//  СвойстваКонвертации - Структура - Структура, которая содержит настройки правил конвертации и таблицу ПКО
//  НаправлениеОбмена - Строка - "Отправка" или "Получение.
//
Процедура ЗаполнитьПравилаКонвертацииОбъектов(СвойстваКонвертации, НаправлениеОбмена) Экспорт
	
	Модуль().ЗаполнитьПравилаКонвертацииОбъектов(СвойстваКонвертации, НаправлениеОбмена);
	
КонецПроцедуры

#Область ВыгрузкаДанных

//	Вызывается перед выгрузкой объекта.
//	В процедуре можно переопределить выгружаемые данные, ПКО или вызвать отказ выгрузки	
//
// Параметры:
//  ДанныеИБ - Структура - Структура, которая содержит реквизиты справочника "Выгружаемые объекты"
//  ПКО - СтрокаТаблицыЗначений - ПКО выгружаемого объекта.
//	Отказ - Булево - Содержит признак необходимости отказа от выгрузки объекта
//
Процедура ПередВыгрузкойОбъекта(ДанныеИБ, ПКО, Отказ) Экспорт
	
	Модуль().ПередВыгрузкойОбъекта(ДанныеИБ, ПКО, Отказ);
	
КонецПроцедуры

//	Вызывается до выполнения запроса к БД, но после формирования теста запроса к БД.
//	В процедуре можно переопределить текст запроса к выгружаемым данным	
//
// Параметры:
//  ДанныеИБ - Структура - Структура, которая содержит реквизиты справочника "Выгружаемые объекты"
//  ПКО - Строка таблицы значений - ПКО выгружаемого объекта.
//	ТекстЗапроса - Строка - Содержит текст запроса к БД, подготовленный в соответствии с ПКО
//
Процедура ПриФормированииТекстаЗапроса(ДанныеИБ, ПКО, ТекстЗапроса) Экспорт
	
	Модуль().ПриФормированииТекстаЗапроса(ДанныеИБ, ПКО, ТекстЗапроса);
	
КонецПроцедуры

//	Вызывается до начала выгрузки объекта, но после формирования данных выгрузки.
//	В процедуре можно переопределить выгружаемые данные	
//
// Параметры:
//  ДанныеИБ - Структура - Структура, которая содержит реквизиты справочника "Выгружаемые объекты"
//  ПКО - Строка таблицы значений - ПКО выгружаемого объекта.
//	ВыгружаемыеДанные - Структура - Содержит структуру реквизитов выгружаемого объекта, подготовленную к выгрузке в соответствии с ПКО
//
Процедура ПриВыгрузкеОбъекта(ДанныеИБ, ПКО, ВыгружаемыеДанные) Экспорт
	
	Модуль().ПриВыгрузкеОбъекта(ДанныеИБ, ПКО, ВыгружаемыеДанные);
	
КонецПроцедуры

Процедура ПриВыгрузкеСсылки(СсылкаНаОбъект, ВыгружаемыеДанные) Экспорт
	
	Модуль().ПриВыгрузкеСсылки(СсылкаНаОбъект, ВыгружаемыеДанные);
	
КонецПроцедуры

//	Вызывается после формирования текста сообщения выгрузки.
//	В процедуре можно переопределить текст сообщения выгрузки	
//
// Параметры:
//	ВыгружаемыеДанные - Структура - Содержит структуру реквизитов выгружаемого объекта, подготовленную к выгрузке в соответствии с ПКО
//  ДанныеИБ - Структура - Структура, которая содержит реквизиты справочника "Выгружаемые объекты"
//  ПКО - Строка таблицы значений - ПКО выгружаемого объекта.
//	ФорматОбмена - ПеречислениеСсылка.рдв_ФорматыОбмена - формат обмена
//	ТекстСообщения - Строка - Содержит текст сообщения выгрузки
//
Процедура ПослеФормированияТекстаСообщения(ВыгружаемыеДанные, ФорматОбмена, ТекстСообщения) Экспорт
	
	Модуль().ПослеФормированияТекстаСообщения(ВыгружаемыеДанные, ФорматОбмена, ТекстСообщения);
	
КонецПроцедуры

// Имя текущей ИБ.
// 
// Возвращаемое значение:
//  Строка - 
Функция ИмяИБ() Экспорт

	ИмяИБ = Модуль().ИмяИБ();
	Возврат ИмяИБ;
	
КонецФункции

// Произвольные данные к выгрузке служебных объектов
// 
// Параметры:
//  ДанныеИБ - Структура -
// 
// Возвращаемое значение:
//  Структура - из примитивных типов
//
Функция ПодготовитьПроизвольныеДанныеКВыгрузке(ДанныеИБ) Экспорт
	
	ПроизвольныеДанные = Модуль().ПодготовитьПроизвольныеДанныеКВыгрузке(ДанныеИБ);
	Возврат ПроизвольныеДанные;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

//	Вызывается после конвертации текста сообщения в структуру загружаемых данных, до конвертации реквизитов в объекты БД.
//	В процедуре можно переопределить структуру загружаемых данных	
//
// Параметры:
//	ЗагружаемыеДанные - Структура - Содержит структуру реквизитов загружаемого объекта, до конвертации реквизитов в объекты БД
//
Процедура ПередКонвертациейЗагружаемыхДанных( ЗагружаемыеДанные) Экспорт
	
	Модуль().ПередКонвертациейЗагружаемыхДанных(ЗагружаемыеДанные);
	
КонецПроцедуры

//	Вызывается перед конвертацией загружаемых данных в объект ИБ.
//	В процедуре можно переопределить свойства загружаемых данных. Если в текущей процедуре будут
//		переопределены свойства, типовой подбор свойст по данным входящего сообщения выполняться не будет
//
// Параметры:
//   СвойстваЗагружаемогоОбъекта - Структура - коллекция свойств загружаемых данных. Реквизиты:
//      * МенеджерОбъекта - Менеджер - Менеджер загружаемого объекта:
//		* ЭтоРегистр - Булево - Признак того, что загружается регистр
//		* ЭтоДокумент - Булево - Признак того, что загружается документ
//		* ЭтоГруппа - Булево - Признак того, что загружается группа справочника
//		* ПКО - СтрокаТлицыЗначений - Правило конвертации объекта
//
Процедура ОпределитьСвойстваЗагружаемогоОбъекта(СвойстваЗагружаемогоОбъекта) Экспорт
	
	Модуль().ОпределитьСвойстваЗагружаемогоОбъекта(СвойстваЗагружаемогоОбъекта);
		
КонецПроцедуры

//	Вызывается при конвертации ссылочных данных (объектов и реквизитов) в объект ИБ.
//	В процедуре можно выполнить свой произвольный поиск ссылки
//
// Параметры:
//	ЗагружаемыеДанные - Структура - Содержит структуру реквизитов загружаемого объекта, до конвертации реквизитов в объекты БД
//  СвойстваЗагружаемогоОбъекта - Структура - коллекция свойств загружаемых данных. Реквизиты:
//      * МенеджерОбъекта - Менеджер - Менеджер загружаемого объекта:
//		* ЭтоРегистр - Булево - Признак того, что загружается регистр
//		* ЭтоДокумент - Булево - Признак того, что загружается документ
//		* ЭтоГруппа - Булево - Признак того, что загружается группа справочника
//		* ПКО - Строка таблицы значений - Правило конвертации объекта
//
// Возвращаемое значение:
//  СправочникСсылка, ДокументСсылка и т.д.
//
Функция НайтиСсылкуНаОбъект(ЗагружаемыеДанные, СвойстваЗагружаемогоОбъекта) Экспорт
	
	Возврат Модуль().НайтиСсылкуНаОбъект(ЗагружаемыеДанные, СвойстваЗагружаемогоОбъекта);
	
КонецФункции

//	Вызывается при конвертации данных перечислений в перечисление ИБ.
//	В процедуре можно выполнить свой произвольный поиск значения перечисления
//
// Параметры:
//	ДанныеРеквизита - Структура - Содержит структуру, которая содержит данные перечисления
//		* _ТипЗначения - Строка - Имя объекта метаданных перечисления в базе-источнике
//		* _Значение - Строка - Значение перечисления как задано в базе-источнике 
// Возвращаемое значение:
//  ПеречислениеСсылка.
//
Функция ПолучитьЗначениеПеречисления(ДанныеРеквизита) Экспорт

	Возврат Модуль().ПолучитьЗначениеПеречисления(ДанныеРеквизита);
	
КонецФункции

//	Вызывается при создании объекта ИБ по загружаемым данным.
//	В процедуре можно переопределить создаваемый объект
//
// Параметры:
//	ЗагружаемыеДанные - Структура - Содержит структуру реквизитов загружаемого объекта, после конвертации реквизитов в объекты БД
//  СвойстваЗагружаемогоОбъекта - Структура - коллекция свойств загружаемых данных. Реквизиты:
//      * МенеджерОбъекта - Менеджер - Менеджер загружаемого объекта:
//		* ЭтоРегистр - Булево - Признак того, что загружается регистр
//		* ЭтоДокумент - Булево - Признак того, что загружается документ
//		* ЭтоГруппа - Булево - Признак того, что загружается группа справочника
//		* ПКО - Строка таблицы значений - Правило конвертации объекта
//
// Возвращаемое значение:
//  СправочникОбъект, ДокументОбъект, НаборЗаписей и т.д.
//
Функция ПолучитьЗагружаемыйОбъект(ЗагружаемыеДанные, СвойстваЗагружаемогоОбъекта) Экспорт
	
	Возврат Модуль().ПолучитьЗагружаемыйОбъект(ЗагружаемыеДанные, СвойстваЗагружаемогоОбъекта);
	
КонецФункции

//	Вызывается перед записью объекта ИБ.
//	В процедуре можно дозаполнить загружаемый объект
//
// Параметры:
//	ЗагружаемыйОбъект - ДокументОбъект, СправочникОбъект, НаборЗаписей и т. - Инициализированный объект БД
//	ЗагружаемыеДанные - Структура - Содержит структуру реквизитов загружаемого объекта, после конвертации реквизитов в объекты БД
//
Процедура ПередЗаписьюЗагружаемогоОбъекта(ЗагружаемыйОбъект, ЗагружаемыеДанные) Экспорт
	
	Модуль().ПередЗаписьюЗагружаемогоОбъекта(ЗагружаемыйОбъект, ЗагружаемыеДанные);
	
КонецПроцедуры

//	Вызывается после записи объекта ИБ.
//	В процедуре можно выполнить постобработчики после записи объекта
//
// Параметры:
//	ЗагружаемыйОбъект - ДокументОбъект, СправочникОбъект, НаборЗаписей и т. - Инициализированный объект БД
//	ЗагружаемыеДанные - Структура - Содержит структуру реквизитов загружаемого объекта, после конвертации реквизитов в объекты БД
//
Процедура ПослеЗаписиЗагружаемогоОбъекта(ЗагружаемыйОбъект, ЗагружаемыеДанные) Экспорт
	
	Модуль().ПослеЗаписиЗагружаемогоОбъекта(ЗагружаемыйОбъект, ЗагружаемыеДанные);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыФункции

Функция Модуль()
	
	Модуль = рдв_МенеджерОбмена.МодульПрикладнойЛогики();
	Возврат Модуль;
	
КонецФункции

#КонецОбласти