
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиФормы = Неопределено;
	Если Параметры.Свойство("НастройкиФормы", НастройкиФормы) Тогда
		
		ИспользоватьАвтообновление = НастройкиФормы.ИспользоватьАвтообновление;
		ПериодОбновления = НастройкиФормы.ПериодОбновления;
		ВыводитьДанныеЗаПоследниеМинут = НастройкиФормы.ВыводитьДанныеЗаПоследниеМинут;
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаОК(Команда)
	
	ТекущаяДата = ТекущаяДата();
	ТекущаяДатаМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = Новый Структура();
	Результат.Вставить("ИспользоватьАвтообновление", ИспользоватьАвтообновление);
	Результат.Вставить("ПериодОбновления", ПериодОбновления);
	Результат.Вставить("ВыводитьДанныеЗаПоследниеМинут", ВыводитьДанныеЗаПоследниеМинут);
	Результат.Вставить("ДатаНачала", ТекущаяДата-(ВыводитьДанныеЗаПоследниеМинут * 60));
	Результат.Вставить("ДатаНачалаМс", ТекущаяДатаМс-(ВыводитьДанныеЗаПоследниеМинут * 60 * 1000));
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
