// Определяет является ли объект метаданных ссылкой.
//
// Параметры:
//  МетаданныеОбъекта - МетаданныеОбъекта - Метаданные.
//
// Возвращаемое значение:
//  Булево - если ИСТИНА - является ссылочным объектом метаданных, если ЛОЖЬ - нет.
//
Функция ЭтоМетаданныеСсылки(МетаданныеОбъекта) Экспорт

	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Или
		Метаданные.Документы.Содержит(МетаданныеОбъекта) Или
		Метаданные.ПланыСчетов.Содержит(МетаданныеОбъекта) Или
		Метаданные.ПланыВидовРасчета.Содержит(МетаданныеОбъекта) Или
		Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
