// Обработчик подписки на событие рдв_РегистрацияИзменений
//
Процедура рдв_РегистрацияИзмененийПриЗаписи(Источник, Отказ) Экспорт

    ЗарегистрироватьИзменения(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие рдв_РегистрацияИзмененийНабораЗаписей
//
Процедура рдв_РегистрацияИзмененийНабораЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт

    ЗарегистрироватьИзменения(Источник);

КонецПроцедуры

// Регистрирует изменения объекта к обмену.
//
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, НаборЗаписейОбъект - Объект, регистрируемый к обмену.
//  Отказ - Булево - Отказ записи объекта.
//
Процедура ЗарегистрироватьИзменения(Источник)

	ПравилаРегистрации = рдв_РегистрацияИмененийПовтИсп.ИнициализироватьПравилаРегистрации();
	МетаданныеИсточника = Источник.Метаданные();
	Если ПравилаРегистрации.Найти(МетаданныеИсточника) <> Неопределено Тогда
		ВыгружаемыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьВыгружаемыйОбъект(Источник);
		РегистрыСведений.рдв_СообщенияОбмена.ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект);
	КонецЕсли;
	
КонецПроцедуры
