
Процедура ПередЗаписью(Отказ)
	
	СформироватьНаименование();
	
КонецПроцедуры

Процедура СформироватьНаименование()
	
	Если Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Произвольный Тогда
		Наименование = ИдентификаторДанных;
	ИначеЕсли Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка Тогда
		Наименование = СсылкаНаОбъект;
	Иначе
		Наименование = "";
		Для Каждого ЭлементОтбора Из ОтборНабораЗаписей Цикл
			Наименование = Наименование + ЭлементОтбора.Имя+": "+ЭлементОтбора.Значение+", ";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
