
#Область ПрограммныйИнтерфейс

// Справочники при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - СправочникСсылка - 
//  Отказ - Булево - 
//
Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	
КонецПроцедуры

// Документы при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - ДокументСсылка
//  Отказ - Булево
//
Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
  	Если ТипИсточника = Тип("ДокументОбъект._ДемоЗаказПокупателя") Тогда
	
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
		
	КонецЕсли;

КонецПроцедуры

// Наборы записей при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей
//  Отказ - Булево
//  Замещение - Булево
//
Процедура НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.КурсыВалют") Тогда 
	
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

