#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСоздатьИБ(ИмяИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	рдв_ИнформационныеБазы.Ссылка
		|ИЗ
		|	Справочник.рдв_ИнформационныеБазы КАК рдв_ИнформационныеБазы
		|ГДЕ
		|	рдв_ИнформационныеБазы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НоваяИБ = СоздатьЭлемент();
		НоваяИБ.Наименование = ИмяИБ;
		НоваяИБ.ДополнительныеСвойства.Вставить("рдв_ОтключитьОбработчикиПриЗаписи", Истина);
		НоваяИБ.рдв_Идентификатор = ИмяИБ;
		НоваяИБ.Записать();
		Возврат НоваяИБ.Ссылка;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Функция Текущая() Экспорт
	
	ИмяИБ = рдв_МенеджерОбменаПовтИсп.ИмяИБ();
	Возврат ПолучитьСоздатьИБ(ИмяИБ);
	
КонецФункции

#Область ПредопределенныеДанные

// Получает предопредлеленный элемент
// 
// Параметры:
//  ИмяПредопределенного - Строка - 
// 
// Возвращаемое значение:
//  Произвольный - Предопределенный
//
Функция Предопределенный(ИмяПредопределенного, ВызыватьИсключение=Ложь) Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенный(ОбъектМетаданных, ИмяПредопределенного, ВызыватьИсключение);
	
КонецФункции

// Получает все предопредлеленные элементы
// 
// 
// Возвращаемое значение:
//  Структура - Элементы
//
Функция Предопределенные() Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенные(ОбъектМетаданных);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
