#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПредопределенныеДанные

// Получает предопредлеленный элемент
// 
// Параметры:
//  ИмяПредопределенного - Строка - 
// 
// Возвращаемое значение:
//  Произвольный - Предопределенный
//
Функция Предопределенный(ИмяПредопределенного, ВызыватьИсключение=Ложь) Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенный(ОбъектМетаданных, ИмяПредопределенного, ВызыватьИсключение);
	
КонецФункции

// Получает все предопредлеленные элементы
// 
// 
// Возвращаемое значение:
//  Структура - Элементы
//
Функция Предопределенные() Экспорт
	
	ОбъектМетаданных = ПустаяСсылка().Метаданные();
	Возврат рдв_ПредопределенныеДанные.Предопределенные(ОбъектМетаданных);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
