Функция ЗарегистрироватьСобытие(ИдентификаторСобытия = Неопределено,
								ИдентификаторСообщения = Неопределено,
								ВыгружаемыйОбъект = Неопределено,
								СсылкаНаОбъект = Неопределено,
								Событие,
								ВнешняяСистема = Неопределено,
								ДатаСобытия = Неопределено,
								СообщениеИнтеграции = Неопределено) Экспорт
								
								
	МенеджерЗаписи = РегистрыСведений.рдв_ЖурналСобытий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСобытия = ИдентификаторСобытия;
	МенеджерЗаписи.ИдентификаторСообщения = ИдентификаторСообщения;
	МенеджерЗаписи.ВыгружаемыйОбъект = ВыгружаемыйОбъект;
	МенеджерЗаписи.СсылкаНаОбъект = СсылкаНаОбъект;
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.ВнешняяСистема = ВнешняяСистема;
	МенеджерЗаписи.ДатаСобытия = ?(ЗначениеЗаполнено(ДатаСобытия), ДатаСобытия, ТекущаяДатаСеанса());
	МенеджерЗаписи.СообщениеИнтеграции = СообщениеИнтеграции;
	МенеджерЗаписи.Записать();
								
КонецФункции
							