
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.Ссылка") Тогда
		Элементы.СсылкаНаОбъект.Видимость = Истина;
		Элементы.ОтборНабораЗаписей.Видимость = Ложь;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.НаборЗаписей") Тогда
		Элементы.СсылкаНаОбъект.Видимость = Ложь;
		Элементы.ОтборНабораЗаписей.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.Произвольный") Тогда
		Элементы.СсылкаНаОбъект.Видимость = Ложь;
		Элементы.ОтборНабораЗаписей.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
	



