
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ГруппаСсылка.Видимость = Ложь;
	Элементы.ГруппаНаборЗаписей.Видимость = Ложь;
	Элементы.ГруппаПодтверждениеПолучения.Видимость = Ложь;
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.Ссылка") Тогда
		Элементы.ГруппаСсылка.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.НаборЗаписей") Тогда
		Элементы.ГруппаНаборЗаписей.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения") Тогда
		Элементы.ГруппаПодтверждениеПолучения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
	



