#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьКонфиденциальныеПараметрыАутентификации(ВнешняяСистема, Параметры) Экспорт
	 
	 Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВнешняяСистема, Параметры);
	 
 КонецФункции
 
 Процедура УстановитьРасписание(Объект, Расписание, ИспользованиеРегламента) Экспорт
	
	УстановитьРасписаниеИнтеграции(Объект, Расписание, ИспользованиеРегламента);	
	
КонецПроцедуры

Процедура УстановитьРасписаниеИнтеграции(Объект, Расписание, Использование) Экспорт
	
	//ТипОчереди = ТипОчередиОбъект.Ссылка;

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Объект.Наименование);

	Если Использование И ПустаяСтрока(Объект.ИмяПользователяРегламента) Тогда
		ИмяПользователя = рдв_ОбщегоНазначения.ИмяИзСинонима(Строка(Объект.Наименование));
		ИмяПользователя = СтрШаблон(НСтр("ru = 'робот_%1'"), ИмяПользователя);
		Объект.ИмяПользователяРегламента = ИмяПользователя;
	КонецЕсли;
	
	ИмяРегламента = ИмяРегламента();
	НаименованиеЗадания = НаименованиеРегламента(Объект);
	//
	МодульУправленияРегламентами = МодульУправленияРегламентами(ИмяРегламента);
	МодульУправленияРегламентами.УстановитьРасписание(ИмяРегламента, Расписание,
		Объект.РегламентноеЗаданиеGUID, НаименованиеЗадания, ПараметрыЗадания,
		Объект.ИмяПользователяРегламента, Использование);
	
КонецПроцедуры

Функция ИмяРегламента() Экспорт
	Возврат "рдв_ЗапускИнтеграции";
КонецФункции

Функция НаименованиеРегламента(Объект) Экспорт
	Наименование = НСтр("ru = 'Интеграция: %1'");
	Наименование = СтрШаблон(Наименование, Строка(Объект.Наименование));
	Возврат Наименование;
КонецФункции

Функция МодульУправленияРегламентами(ИмяРегламента) Экспорт

	Возврат рдв_РегламентныеЗадания;

КонецФункции

Функция ВнешняяСистемаПоИмени(Имя) Экспорт
	
	Возврат Справочники.рдв_ВнешниеСистемы.НайтиПоНаименованию(Имя);
	
КонецФункции

#КонецОбласти

#КонецЕсли
