// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//Процедура ПередЗаписью(Отказ, Замещение)
//	
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;	
//	КонецЕсли;
//	
//	Для Каждого Запись Из ЭтотОбъект Цикл
//		Если Не ЗначениеЗаполнено(Запись.ДатаСоответствия) Тогда
//			Если ЗначениеЗаполнено(Запись.СообщениеИнтеграции.ДатаСообщения) Тогда
//				Запись.ДатаСоответствия = Запись.СообщениеИнтеграции.ДатаСообщения;
//			ИначеЕсли ЗначениеЗаполнено(Запись.СообщениеИнтеграции.ДатаОтвета) Тогда
//				Запись.ДатаСоответствия = Запись.СообщениеИнтеграции.ДатаОтвета;
//			Иначе
//				Запись.ДатаСоответствия = ТекущаяДата();
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//		
//КонецПроцедуры

#КонецОбласти

#КонецЕсли
