
#Область СлужебныеПроцедурыИФункции

// Новая таблица хешей
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//	  * ВидХеша - СправочникСсылка.рдв_ВидыХешей
//	  * Хеш - ОпределяемыйТип.рдв_ХешТип
//
Функция НоваяТаблицаХешей() Экспорт
	
	НоваяТаблицаХешей = рдв_ХешиОбъектовПереопределяемый.НоваяТаблицаХешей();
	
	Если Не НоваяТаблицаХешей = Неопределено Тогда
		Возврат НоваяТаблицаХешей;
	КонецЕсли;
	
	ТаблицаХешей = РегистрыСведений.рдв_ХешиОбъектов.СоздатьНаборЗаписей().ВыгрузитьКолонки("ВидХеша, Хеш");
	
	Возврат ТаблицаХешей;
	
КонецФункции

// Вид хеша, используемый по умолчанию для объектов
// 
// Возвращаемое значение:
//  СправочникСсылка.рдв_ВидыХешей
//
Функция ХешВидПоУмолчанию() Экспорт
	
	ВидХеша = рдв_ХешиОбъектовПереопределяемый.ХешВидПоУмолчанию();
	
	Возврат ВидХеша;
	
КонецФункции

#КонецОбласти
