
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяРегистраЖурналаОчередей = рдв_РаботаСОчередямиКлиентСерверПереопределяемый.ИмяРегистраЖурналаОчередей();
	ИмяФормы = СтрШаблон("РегистрСведений.%1.ФормаСписка", ИмяРегистраЖурналаОчередей);
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму(ИмяФормы,
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры
