// Инициализирует правила регистрации объектов к выгрузке.
//
// Возвращаемое значение:
//  ТаблицаЗначений, которая содержит список объектов метаданных, которые необходимо регистрировать
//
Функция ИнициализироватьПравилаРегистрации() Экспорт
	
	ПравилаРегистрации = ПравилаРегистрации();
	рдв_РегистрацияИзмененийПереопределяемый.ЗаполнитьПравилаРегистрации(ПравилаРегистрации);
	
	//регистрация для выгрузки в мониторинг
	рдв_МониторингДанных.ЗаполнитьПравилаРегистрации(ПравилаРегистрации);
	
	Возврат ПравилаРегистрации;
	
КонецФункции

Функция ПравилаРегистрации()

	ПравилаРегистрации = Новый ТаблицаЗначений;
	ПравилаРегистрации.Колонки.Добавить("МетаданныеОбъекта");
	ПравилаРегистрации.Колонки.Добавить("ВнешняяСистема");
	ПравилаРегистрации.Колонки.Добавить("ВидСообщения");
	ПравилаРегистрации.Колонки.Добавить("АдресМетода");
	Возврат ПравилаРегистрации;
	
КонецФункции

