// Инициализирует правила регистрации объектов к выгрузке.
//
// Возвращаемое значение:
//  Массив, который содержит список объектов метаданных, которые необходимо регистрировать
//
Функция ИнициализироватьПравилаРегистрации() Экспорт
	
	ПравилаРегистрации = ПравилаРегистрации();
	рдв_РегистрацияИзмененийПереопределяемый.ЗаполнитьПравилаРегистрации(ПравилаРегистрации);
	
	Возврат ПравилаРегистрации;
	
КонецФункции

Функция ПравилаРегистрации()

	ПравилаРегистрации = Новый ТаблицаЗначений;
	ПравилаРегистрации.Колонки.Добавить("МетаданныеОбъекта");
	ПравилаРегистрации.Колонки.Добавить("ВнешняяСистема", Новый ОписаниеТипов("СправочникСсылка.рдв_ВнешниеСистемы"));
	ПравилаРегистрации.Колонки.Добавить("Интерфейс");
	ПравилаРегистрации.Колонки.Добавить("ВидСообщения");
	ПравилаРегистрации.Колонки.Добавить("АдресМетода");
	Возврат ПравилаРегистрации;
	
КонецФункции

