
&НаСервере
Процедура СформироватьСообщения()
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыгрузки = Новый Соответствие;
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		Запись = РегистрыСведений.рдв_РегистрацияИзменений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Прочитать();
		ВнешняяСистема = Запись.ВнешняяСистема;
		МассивИдентификаторов = ДанныеВыгрузки.Получить(ВнешняяСистема);
		Если МассивИдентификаторов = Неопределено Тогда
			МассивИдентификаторов = Новый Массив;
		КонецЕсли;
		МассивИдентификаторов.Добавить(Строка.ИдентификаторСообщения);
		ДанныеВыгрузки.Вставить(ВнешняяСистема, МассивИдентификаторов);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ДанныеВыгрузки Цикл
		Попытка
			рдв_Интеграция.СообщениеСформировать(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Исключение
			Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	СформироватьСообщения();
	Элементы.Список.Обновить();
КонецПроцедуры
