#Область ПрограммныйИнтерфейс

// Типы входящих сообщений.
// 
// Возвращаемое значение:
//  Структура - Типы входящих сообщений:
// * ПодтверждениеПолучения - Строка - 
// * СверкаСостояний - Строка - 
Функция ТипыВходящихСообщений() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ПодтверждениеПолучения", "Подтверждение получения");
	Структура.Вставить("СверкаСостояний", "Сверка состояний");
	
	Возврат Структура;
	
КонецФункции

Функция ВидСообщенияИнтеграцииВыгружаемыеОбъекты() Экспорт
	
	Значение = Справочники.рдв_ВидыСообщенийИнтеграции.НайтиПоРеквизиту("ИмяВидаСообщения", "ВыгружаемыеОбъекты");
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти