
#Область ПрограммныйИнтерфейс

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
		
	Если ТипИсточника = Тип("СправочникОбъект._ДемоКонтрагенты") Тогда
		рдв_РаботаСОчередями.ДобавитьВОчередь("РегистрацияКонтрагентов", Источник.Ссылка);
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.рдв_СообщенияИнтеграции") Тогда
		Если Источник.Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее Тогда
			рдв_РаботаСОчередями.ДобавитьВОчередь("ОбработкаВходящихСообщений", Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	

КонецПроцедуры

Процедура НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
  	Если ТипИсточника = Тип("РегистрСведенийНаборЗаписей.КурсыВалют") Тогда
		рдв_РегистрацияИзменений.ЗарегистрироватьИзменения(Источник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

