#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяОтборПоИдентификаторуЗаписи = Отбор.ИдентификаторЗаписи.Использование;
	
	Если Количество() = 1
		И ИспользуетсяОтборПоИдентификаторуЗаписи
		И Не ЗначениеЗаполнено(Отбор.ИдентификаторЗаписи.Значение) Тогда
		Отбор.ИдентификаторЗаписи.Значение = Строка(Новый УникальныйИдентификатор);
		ЭтотОбъект[0].ИдентификаторЗаписи = Отбор.ИдентификаторЗаписи.Значение;
	КонецЕсли;
		
	Для Каждого Запись Из ЭтотОбъект Цикл
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Если Не ЗначениеЗаполнено(Запись.ДатаСозданияUTC) Тогда
			Запись.ДатаСозданияUTC = ТекущаяДатаСеанса;
		КонецЕсли;
		Если Не ИспользуетсяОтборПоИдентификаторуЗаписи И Не ЗначениеЗаполнено(Запись.ИдентификаторЗаписи) Тогда
			Запись.ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор);
		Конецесли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

