
#Область ПрограммныйИнтерфейс

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	рдв_ОтключитьОбработчикиПриЗаписи = Ложь;
	Источник.ДополнительныеСвойства.Свойство("рдв_ОтключитьОбработчикиПриЗаписи", рдв_ОтключитьОбработчикиПриЗаписи);
	Если рдв_ОтключитьОбработчикиПриЗаписи = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	рдв_ОбработчикиСобытийПереопределяемый.СправочникиПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	рдв_ОтключитьОбработчикиПриЗаписи = Ложь;
	Источник.ДополнительныеСвойства.Свойство("рдв_ОтключитьОбработчикиПриЗаписи", рдв_ОтключитьОбработчикиПриЗаписи);
	Если рдв_ОтключитьОбработчикиПриЗаписи = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	рдв_ОбработчикиСобытийПереопределяемый.ДокументыПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	рдв_ОтключитьОбработчикиПриЗаписи = Ложь;
	Источник.ДополнительныеСвойства.Свойство("рдв_ОтключитьОбработчикиПриЗаписи", рдв_ОтключитьОбработчикиПриЗаписи);
	Если рдв_ОтключитьОбработчикиПриЗаписи = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	рдв_ОбработчикиСобытийПереопределяемый.НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение);
	
КонецПроцедуры

#КонецОбласти

