
#Область ПрограммныйИнтерфейсСлужебный

// Обработчик события создания пользователя регламентированного задания.
//
// Вызывается при установке расписания регламента с назначенным пользователем
// до создания пользователя ИБ. Обработчик может использоваться, например,
// - для создания элемента справочника "Пользователи", ассоциированного пользователем ИБ.
// - для отказа создания пользователя ИБ стандартной обработкой.
//
// Параметры:
//  ОписаниеПользователя  	- Структура - свойства пользователя ИБ, который будет назначен для обработки очереди регламентом:
//		** Имя 			  	- Строка   - имя пользователя. Если пользователя с таким именем в ИБ нет, будет создан новый.
//							  Значение по умолчанию: "робот_[ИмяПредопределенныхДанных]", либо "робот_[НаименованиеОчереди]".
//							  Возможно задать собственное имя назначемого пользователя.
//		** Пароль		  	- Строка - пароль, назначаемый новому пользователю ИБ. По умолчанию генерируется случайный.
//		** Аутентификация1С	- Булево - признак использования стандартной аутентификации. По умолчанию не используется.
//		** Роли				- Массив из ОбъектМетаданных - роли, назначаемые новому пользователю ИБ при создании.
//							  По умолчанию совпадают с основными ролями конфигурации.
//  Регламент               - ОбъектМетаданных - регламентное задание.
//  ПараметрыРегламента     - Массив - массив значений аргументов процеудры регламента.
//  СтандартнаяОбработка 	- Булево - Признак выполнения стандартной обработки события. По умолчанию "Истина".
//							  При отказе от стандартной обработки новый пользователь ИБ не создается,
//							  пользователь обработки очереди не назначается.
//
Процедура ПередСозданиемСлужебногоПользователя(ОписаниеПользователя, ИмяРегламента, ПараметрыРегламента, СтандартнаяОбработка) Экспорт
	
	//СтандартнаяОбработка = Ложь;
	//
	//ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ОписаниеПользователя.Имя);
	//Если ПользовательИБ <> Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДоступныеРоли = Новый Массив;
	//ДоступныеРоли.Добавить("АдминистраторСистемы");
	//ДоступныеРоли.Добавить("ПолныеПрава");
	//
	//ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	//ОписаниеПользователяИБ.Вставить("Имя", ОписаниеПользователя.Имя);		
	//ОписаниеПользователяИБ.Вставить("Пароль", ОписаниеПользователя.Пароль);
	//ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", ОписаниеПользователя.Аутентификация1С);
	//ОписаниеПользователяИБ.Вставить("ПоказыватьВСпискеВыбора", Ложь);
	//ОписаниеПользователяИБ.Вставить("Роли", ДоступныеРоли);
	//ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	//
	//Уточнение = НСтр("ru = 'Служебный пользователь регламента ""%1""'");
	//Уточнение = СтрШаблон(Уточнение, ИмяРегламента);
	//
	//ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
	//ПользовательОбъект.Наименование = ОписаниеПользователя.Имя;
	//ПользовательОбъект.Служебный = Истина;
	//ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	//ПользовательОбъект.ДополнительныеСвойства.Вставить("СозданиеАдминистратора", Уточнение);
	//ПользовательОбъект.Записать();

КонецПроцедуры

// Обработчик события создания пользователя регл. задания.
//
// Вызывается перед установкой расписания регламентого задания.
// Обработчик может использоваться, например, для создания элемента справочника "Пользователи",
// ассоциированного с назначенным пользователем обработки очереди.
//
// Параметры:
//	ПользовательИБ          - ПользовательИнформационнойБазы - пользователь регламентного задания.
//  Регламент               - ОбъектМетаданных - регламентное задание.
//  ПараметрыРегламента     - Массив - массив значений аргументов процеудры регламента.
//
Процедура ПриСозданииСлужебногоПользователя(ПользовательИБ, Регламент, ПараметрыРегламента) Экспорт

КонецПроцедуры

#КонецОбласти
