#Область ПрограммныйИнтерфейс

// Адрес внешней системы мониторинга для выгрузки логов.
// 
// Возвращаемое значение:
//  СправочникСсылка.рдв_ВнешниеСистемы - 
Функция ВнешняяСистемаМониторинга() Экспорт

	RMQ = Справочники.рдв_ВнешниеСистемы.Предопределенный("RMQ");
	Возврат RMQ;	

	//для отправки сообщений в CH через HTTP в дополнительных настройках внешней системы необходимо заполнить Параметры URL
	//значением "?query=INSERT%20INTO%20prod.messages_fulltext%20%28message_text%29%20FORMAT%20RawBLOB"
	
КонецФункции

#КонецОбласти