
Функция ExchangePOST(Запрос)
	
	Возврат ОбработатьЗапрос(Запрос, "POST", "exchange");

КонецФункции

Функция ExchangeGET(Запрос)

	Возврат ОбработатьЗапрос(Запрос, "GET", "exchange");

КонецФункции

Функция ОбработатьЗапрос(Запрос, Метод, ИмяВидаСообщения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСервиса = рдв_РаботаССервисамиПереопределяемый.ПараметрыСервиса();
	
	Попытка
		
		Ответ = рдв_РаботаССервисами.ОбработатьВходящийЗапрос(ПараметрыСервиса, Запрос, ИмяВидаСообщения);
		
	Исключение
		рдв_РаботаССервисами.ЗаписатьИсключениеСервисаВЖурналРегистрации(
			ПараметрыСервиса,
			ИмяВидаСообщения,
			ИнформацияОбОшибке()
		);
		
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции
