
#Область ПрограммныйИнтерфейс

// Справочники при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - СправочникСсылка - 
//  Отказ - Булево - 
Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт

	Модуль().СправочникиПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

// Документы при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - ДокументСсылка
//  Отказ - Булево
Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	Модуль().ДокументыПриЗаписи(Источник, Отказ);

КонецПроцедуры

// Наборы записей при записи. Регистрация изменений к отправке.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей
//  Отказ - Булево
//  Замещение - Булево
Процедура НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Модуль().НаборыЗаписейПриЗаписи(Источник, Отказ, Замещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Модуль()
	
	Модуль = рдв_ОбработчикиСобытий.МодульПрикладнойЛогики();
	Возврат Модуль;
	
КонецФункции

#КонецОбласти

