#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокОчередей(СписокОчередей) Экспорт
	
	рдв_ФормированиеХешейОбъектов.ЗаполнитьСписокОчередей(СписокОчередей);
	
	рдв_РаботаСОчередямиИнтеграцииПереопределяемый.ЗаполнитьСписокОчередей(СписокОчередей);
	
КонецПроцедуры

Процедура ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект) Экспорт
	
	рдв_ФормированиеХешейОбъектов.ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект);
	
	рдв_РаботаСОчередямиИнтеграцииПереопределяемый.ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки) Экспорт
	
	рдв_ФормированиеХешейОбъектов.ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки);
	
	рдв_РаботаСОчередямиИнтеграцииПереопределяемый.ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки);
	
КонецПроцедуры

#КонецОбласти