// Заполняет правила регистрации объектов к выгрузке
//
// Параметры:
//  ПравилаРегистрации - Массив - Содержит список объектов метаданных, которые необходимо регистрировать
//
Процедура ЗаполнитьПравилаРегистрации(ПравилаРегистрации) Экспорт
		
	//рдв_МодульИнтеграцииДемо.ЗаполнитьПравилаРегистрации(ПравилаРегистрации);
	
КонецПроцедуры

Процедура ДобавитьПравилоРегистрации(ПравилаРегистрации, 
										МетаданныеОбъекта, 
										ВнешняяСистема, 
										ИмяИнтерфейса = "", 
										ПредставлениеИнтерфейса = "", 
										АдресМетода = "", 
										ИмяВидаСообщения = "")

										
	Интерфейс = Неопределено;
	ВидСообщения = Неопределено;

	Если ЗначениеЗаполнено(ИмяИнтерфейса) Тогда
		ПараметрыСервиса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса", ИмяИнтерфейса, ПредставлениеИнтерфейса);
		ДанныеСервиса = Новый Структура("ПараметрыСервиса", ПараметрыСервиса);
		Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ПараметрыСервиса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВидаСообщения) И ЗначениеЗаполнено(Интерфейс) Тогда
		ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, ИмяВидаСообщения);
	КонецЕсли;
											
	ПравилоРегистрации = ПравилаРегистрации.Добавить();
	ПравилоРегистрации.МетаданныеОбъекта = МетаданныеОбъекта;
	ПравилоРегистрации.ВнешняяСистема = ВнешняяСистема;
	ПравилоРегистрации.Интерфейс = Интерфейс;
	ПравилоРегистрации.АдресМетода = АдресМетода;
	ПравилоРегистрации.ВидСообщения = ВидСообщения;
	
КонецПроцедуры
