// @strict-types

#Область ПрограммныйИнтерфейс

// Заполняет правила регистрации объектов к выгрузке
//
// Параметры:
//  ПравилаРегистрации - ТаблицаЗначений - Содержит список объектов метаданных, которые необходимо регистрировать
//
Процедура ЗаполнитьПравилаРегистрации(ПравилаРегистрации) Экспорт
	
	Модуль = рдв_Интеграция.МодульБизнесЛогикиИнтеграции();
	//@skip-check dynamic-access-method-not-found
	Модуль.ЗаполнитьПравилаРегистрации(ПравилаРегистрации);
	
КонецПроцедуры

// Определяет маршрут сообщения по объекту выгрузки
// 
// Параметры:
//  ИсточникСообщения - ЛюбаяСсылка - если выгружается ссылка то сама ссылка, если набор то СправочникСсылка.рдв_ВыгружаемыйОбъект
//  ВнешняяСистема - СправочникСсылка.рдв_ВнешниеСистемы -
// 
// Возвращаемое значение:
//  Строка - 
Функция МаршрутСообщения(ИсточникСообщения, ВнешняяСистема) Экспорт
	
	Модуль = рдв_Интеграция.МодульБизнесЛогикиИнтеграции();
	//@skip-check dynamic-access-method-not-found
	МаршрутСообщения = Модуль.МаршрутСообщения(ИсточникСообщения, ВнешняяСистема); // Строка
	
	Возврат МаршрутСообщения;
	
КонецФункции

#КонецОбласти
