// Заполняет правила регистрации объектов к выгрузке
//
// Параметры:
//  ПравилаРегистрации - Массив - Содержит список объектов метаданных, которые необходимо регистрировать
//
Процедура ЗаполнитьПравилаРегистрации(ПравилаРегистрации) Экспорт
		
	ВнешняяСистема = Справочники.рдв_ВнешниеСистемы.НайтиПоНаименованию("RMQ");
	
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКонтрагенты, 
								ВнешняяСистема, 
								"RMQ",
								"RMQ",
								"exchange",
								"Контрагенты");

	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.РегистрыСведений.КурсыВалют, 
								ВнешняяСистема, 
								"RMQ",
								"RMQ",
								"exchange",
								"КурсыВалют");

								
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКассы, 
								ВнешняяСистема, 
								"RMQ",
								"RMQ",
								"exchange",
								"Кассы");

								
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Документы._ДемоЗаказПокупателя, 
								ВнешняяСистема, 
								"RMQ",
								"RMQ",
								"exchange",
								"ЗаказПокупателя");
								
КонецПроцедуры

Процедура ДобавитьПравилоРегистрации(ПравилаРегистрации, 
										МетаданныеОбъекта, 
										ВнешняяСистема, 
										ИмяИнтерфейса = "", 
										ПредставлениеИнтерфейса = "", 
										АдресМетода = "", 
										ИмяВидаСообщения = "")

										
	Интерфейс = Неопределено;
	ВидСообщения = Неопределено;

	Если ЗначениеЗаполнено(ИмяИнтерфейса) Тогда
		ПараметрыСервиса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса", ИмяИнтерфейса, ПредставлениеИнтерфейса);
		ДанныеСервиса = Новый Структура("ПараметрыСервиса", ПараметрыСервиса);
		Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ДанныеСервиса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВидаСообщения) И ЗначениеЗаполнено(Интерфейс) Тогда
		ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, ИмяВидаСообщения);
	КонецЕсли;
											
	ПравилоРегистрации = ПравилаРегистрации.Добавить();
	ПравилоРегистрации.МетаданныеОбъекта = МетаданныеОбъекта;
	ПравилоРегистрации.ВнешняяСистема = ВнешняяСистема;
	ПравилоРегистрации.Интерфейс = Интерфейс;
	ПравилоРегистрации.АдресМетода = АдресМетода;
	ПравилоРегистрации.ВидСообщения = ВидСообщения;
	
КонецПроцедуры
