// Заполняет правила регистрации объектов к выгрузке
//
// Параметры:
//  ПравилаРегистрации - Массив - Содержит список объектов метаданных, которые необходимо регистрировать
//
Процедура ЗаполнитьПравилаРегистрации(ПравилаРегистрации) Экспорт
	
	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.Справочники._ДемоКонтрагенты, 
								Справочники.рдв_ВнешниеСистемы.рдв_Демо, 
								"рдв_Демо",
								"Демо (РДВ)",
								"/exchange",
								"exchange");

	ДобавитьПравилоРегистрации(ПравилаРегистрации, 
								Метаданные.РегистрыСведений.КурсыВалют, 
								Справочники.рдв_ВнешниеСистемы.рдв_Демо, 
								"рдв_Демо",
								"Демо (РДВ)",
								"/exchange",
								"exchange");
								
КонецПроцедуры

Процедура ДобавитьПравилоРегистрации(ПравилаРегистрации, 
										МетаданныеОбъекта, 
										ВнешняяСистема, 
										ИмяИнтерфейса = "", 
										ПредставлениеИнтерфейса = "", 
										АдресМетода = "", 
										ИмяВидаСообщения = "")

										
	Интерфейс = Неопределено;
	ВидСообщения = Неопределено;

	Если ЗначениеЗаполнено(ИмяИнтерфейса) Тогда
		ПараметрыСервиса = Новый Структура("ИмяИнтерфейса, ПредставлениеИнтерфейса", ИмяИнтерфейса, ПредставлениеИнтерфейса);
		ДанныеСервиса = Новый Структура("ПараметрыСервиса", ПараметрыСервиса);
		Интерфейс = Справочники.рдв_ИнтерфейсыИнтеграции.ПолучитьИнтерфейс(ДанныеСервиса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяВидаСообщения) И ЗначениеЗаполнено(Интерфейс) Тогда
		ВидСообщения = Справочники.рдв_ВидыСообщенийИнтеграции.ПолучитьВидСообщения(Интерфейс, ИмяВидаСообщения);
	КонецЕсли;
											
	ПравилоРегистрации = ПравилаРегистрации.Добавить();
	ПравилоРегистрации.МетаданныеОбъекта = МетаданныеОбъекта;
	ПравилоРегистрации.ВнешняяСистема = ВнешняяСистема;
	ПравилоРегистрации.Интерфейс = Интерфейс;
	ПравилоРегистрации.АдресМетода = АдресМетода;
	ПравилоРегистрации.ВидСообщения = ВидСообщения;
	
КонецПроцедуры
