
Функция ExchangePOST(Запрос)
	
	Возврат ОбработатьЗапрос(Запрос, "POST", "exchange");

КонецФункции

Функция ExchangeGET(Запрос)

	Возврат ОбработатьЗапрос(Запрос, "GET", "exchange");

КонецФункции

Функция ОбработатьЗапрос(Запрос, Метод, ИмяВидаСообщения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Запрос", Запрос);
	ПараметрыЗапроса.Вставить("ИмяВидаСообщения", ИмяВидаСообщения);
	ПараметрыЗапроса.Вставить("ЭтоВходящийЗапрос", Истина);
	
	ВнешняяСистема = Справочники.рдв_ВнешниеСистемы.Предопределенный("рдв_Демо");
	Попытка
		
		рдв_Интеграция.ИнтеграцияПолучение(ВнешняяСистема, ПараметрыЗапроса);
		
		Ответ = ПараметрыЗапроса.Ответ;
		Возврат Ответ;
		
	Исключение
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецФункции
