
#Область ПрограммныйИнтерфейс

// Проверяет заполнение расписания
//
Функция РасписаниеЗадано(Расписание) Экспорт
	Возврат Расписание <> Неопределено
		И Строка(Расписание) <> Строка(Новый РасписаниеРегламентногоЗадания);
КонецФункции

// Создает расписание задания с коротким периодом (< 1 минуты),
// с циклом внутри процедуры заданияи ограниченным временнам жизни.
//
Функция РасписаниеЧастоПовторяемогоЗадания(Знач ПериодЗаданияСек, Знач ВремяЖизниЗаданияМин) Экспорт
	
	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	Если ЗначениеЗаполнено(ПериодЗаданияСек) Тогда
		
		Если Не ЗначениеЗаполнено(ВремяЖизниЗаданияМин) Тогда
			ВремяЖизниЗаданияМин = 15;
		КонецЕсли;
		ИнтервалЗавершения = ВремяЖизниЗаданияМин * 3 * 60; 
		
		Если ПериодЗаданияСек < 60 Тогда
			ПериодПовтораВТечениеДня = 60;
		Иначе
			ПериодПовтораВТечениеДня = ПериодЗаданияСек;
		КонецЕсли;
		
		РасписаниеЗадания.ПериодПовтораДней = 1;
		РасписаниеЗадания.ПериодНедель = 1;
		РасписаниеЗадания.ПериодПовтораВТечениеДня = ПериодПовтораВТечениеДня;
		РасписаниеЗадания.ИнтервалЗавершения = ИнтервалЗавершения;
		
	КонецЕсли;
	
	Возврат РасписаниеЗадания;

КонецФункции

// Простое расписание периодического задания.
//
Функция ПростоеРасписание(Знач ПериодЗапускаСек, Знач ИнтервалЗавершенияСек = 0) Экспорт
	
	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеЗадания.ПериодПовтораДней = 1;
	РасписаниеЗадания.ПериодНедель = 1;
	РасписаниеЗадания.ПериодПовтораВТечениеДня = ПериодЗапускаСек;
	РасписаниеЗадания.ИнтервалЗавершения = ИнтервалЗавершенияСек;
	
	Возврат РасписаниеЗадания;

КонецФункции

#КонецОбласти
