
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаписьДанных = РегистрыСведений.рдв_ДанныеСообщенийИнтеграции.СоздатьМенеджерЗаписи();
	ЗаписьДанных.СообщениеИнтеграции = Объект.Ссылка;
	ЗаписьДанных.Прочитать();
	
	Если ЗаписьДанных.Выбран() Тогда
		ДанныеЗапроса = ЗаписьДанных.ДанныеСообщения.Получить();
		ДанныеОтвета = ЗаписьДанных.ДанныеОтвета.Получить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СтруктурироватьДанные(Команда)
	СтруктурироватьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтруктурироватьДанныеНаСервере()
	ДанныеЗапроса = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеЗапроса);
	ДанныеОтвета = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеОтвета);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()

	ТипВнешнейСистемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВнешняяСистема, "Тип");
	Если ТипВнешнейСистемы = Перечисления.рдв_ТипыВнешнихСистем.HTTPСервис Тогда
		Элементы.ГруппаЗаголовкиЗапроса.Видимость = Истина;
		Элементы.ГруппаПараметрыЗапроса.Видимость = Истина;
		Элементы.ГруппаПараметрыURL.Видимость = Истина;
		Элементы.ГруппаЗаголовкиОтвета.Видимость = Истина;
		Элементы.ГруппаДанныеОтвета.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗаголовкиЗапроса.Видимость = Ложь;
		Элементы.ГруппаПараметрыЗапроса.Видимость = Ложь;
		Элементы.ГруппаПараметрыURL.Видимость = Ложь;
		Элементы.ГруппаЗаголовкиОтвета.Видимость = Ложь;
		Элементы.ГруппаДанныеОтвета.Видимость = Ложь;
	КонецЕсли;		
	
КонецПроцедуры
