
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаписьДанных = РегистрыСведений.рдв_ДанныеСообщенийИнтеграции.СоздатьМенеджерЗаписи();
	ЗаписьДанных.СообщениеИнтеграции = Объект.Ссылка;
	ЗаписьДанных.Прочитать();
	
	Если ЗаписьДанных.Выбран() Тогда
		ДанныеЗапроса = ЗаписьДанных.ДанныеСообщения.Получить();
		ДанныеОтвета = ЗаписьДанных.ДанныеОтвета.Получить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СтруктурироватьДанные(Команда)
	СтруктурироватьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтруктурироватьДанныеНаСервере()
	ДанныеЗапроса = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеЗапроса);
	ДанныеОтвета = рдв_РаботаССервисами.СтруктурироватьТекстJSON(ДанныеОтвета);
КонецПроцедуры
