
#Область ПрограммныйИнтерфейс 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

Процедура ПередНачаломВыполненияКоманды(Форма, Команда, Источник, СтандартнаяОбработка) Экспорт
	
	Если СтрСравнить(Команда.Имя, "рдв_ПоказатьИнструкциюНаПортале") = 0 Тогда
		СоответствиеОбъектовМетаданныхИнструкций = рдв_РаботаСИнструкциямиВызовСервера
		                                               .ПолучитьСоответствиеОбъектовМетаданныхИнструкций();
		МассивПодстрок = СтрРазделить(Форма.ИмяФормы, ".");
		ИмяМетаданных = СтрШаблон("%1.%2", МассивПодстрок[0], МассивПодстрок[1]);
		
		Адрес = СоответствиеОбъектовМетаданныхИнструкций.Получить(ИмяМетаданных);
		ПараметрыОткрытия = Новый Структура("Адрес", Адрес);
		ОткрытьФорму("ОбщаяФорма.рдв_ФормаHTMLДокумента", ПараметрыОткрытия, Форма);
		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

