#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьИнтерфейс(ПараметрыСервиса) Экспорт
	
	//ПараметрыСервиса = ДанныеСервиса.ПараметрыСервиса;
	
	НайденныйИнтерфейс = НайтиПоРеквизиту("ИмяИнтерфейса", ПараметрыСервиса.ИмяИнтерфейса);
	Если ЗначениеЗаполнено(НайденныйИнтерфейс) Тогда
		Возврат НайденныйИнтерфейс;
	КонецЕсли;
	
	НовыйИнтерфейс = СоздатьЭлемент();
	НовыйИнтерфейс.Наименование = ПараметрыСервиса.ПредставлениеИнтерфейса;
	НовыйИнтерфейс.ИмяИнтерфейса = ПараметрыСервиса.ИмяИнтерфейса;
	НовыйИнтерфейс.ЗаписыватьДанныеСообщений = Истина;
	НовыйИнтерфейс.УстановитьНовыйКод();
	НовыйИнтерфейс.Записать();
	
	Возврат НовыйИнтерфейс.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
