
#Область ПрограммныйИнтерфейс

Функция ПолучитьСоответствиеОбъектовМетаданныхИнструкций() Экспорт
	
	// VELO-1570 05.02.2024 pkharchuk@rdv.team
	
	УстановитьПривилегированныйРежим(Истина);
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеОбъектовИнструкций.ОбъектМетаданных КАК ОбъектМетаданных,
	|	СоответствиеОбъектовИнструкций.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.рдв_СоответствиеОбъектовИнструкций КАК СоответствиеОбъектовИнструкций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.ОбъектМетаданных, Выборка.Адрес);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

