Процедура РегламентОтправкиСообщенийДиагностики() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.рдв_ОтправкаСообщенийДиагностики);
	
	ЗарегистрироватьСообщениеДиагностики();
	
КонецПроцедуры

Процедура ЗарегистрироватьСообщениеДиагностики()

	ВнешняяСистемаМонторинга = рдв_МенеджерОбменаПереопределяемый.ВнешняяСистемаМониторинга();
	Если ВнешняяСистемаМонторинга = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пинг = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьВыгружаемыйОбъектДиагностики();
	рдв_РегистрацияИзменений.ЗарегистрироватьДанныеДиагностики(ВнешняяСистемаМонторинга
																		, "exchange"
																		, Пинг);

КонецПроцедуры
																																			
Функция ПодготовитьДанныеДиагностики() Экспорт

	Возврат ДанныеКВыгрузке();	
	
КонецФункции

Функция ДанныеКВыгрузке()
	
	ДанныеКВыгрузке = Новый Структура("incoming_queue, outgoing_queue", 0, 0); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.outgoing_queue КАК outgoing_queue,
	|	ВложенныйЗапрос.incoming_queue КАК incoming_queue
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК incoming_queue,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рдв_РегистрацияИзменений.ДатаРегистрацииВМиллисекундах) КАК outgoing_queue
	|	ИЗ
	|		РегистрСведений.рдв_РегистрацияИзменений КАК рдв_РегистрацияИзменений
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рдв_ОчередиОбработкиДанных.ИдентификаторЗаписи),
	|		0
	|	ИЗ
	|		РегистрСведений.рдв_ОчередиОбработкиДанных КАК рдв_ОчередиОбработкиДанных
	|	ГДЕ
	|		рдв_ОчередиОбработкиДанных.Состояние <> ЗНАЧЕНИЕ(Перечисление.рдв_СостоянияОчередейОбработкиДанных.Выполнена)
	|		И рдв_ОчередиОбработкиДанных.ТипОчереди.ИмяОчереди = ""ОбработкаВходящихСообщений"") КАК ВложенныйЗапрос";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеКВыгрузке, Выборка);
	КонецЕсли;
	
	Возврат ДанныеКВыгрузке;
	
КонецФункции
