
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяУниверсальнаяДата());
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяОчередь", "01. Текущая очередь");
	ПараметрыДанных.УстановитьЗначениеПараметра("ЖурналЗаПоследнийЧас", "02. Журнал за час");
	ПараметрыДанных.УстановитьЗначениеПараметра("ЖурналЗаПоследнийДень", "03. Журнал за день");
	
КонецПроцедуры
