
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Представление значения
	
	ПредставлениеЗначенияНастройки = "";
	
	Если ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Значение Тогда
		
		ПредставлениеЗначенияНастройки = Строка(Значение);
		
	ИначеЕсли ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.СписокЗначений Тогда
		
		ЧастиПредставления = Значения.ВыгрузитьКолонку("Значение");
		ПредставлениеЗначенияНастройки = СтрСоединить(ЧастиПредставления, "; ");
		
	ИначеЕсли ВидЗначения = Перечисления.рдв_ВидыЗначенийНастроек.Соответствие Тогда
		
		ЧастиПредставления = Новый Массив();
		Для Каждого Строка Из СоответствиеЗначений Цикл
			ЧастиПредставления.Добавить(
				СтрШаблон("%1: %2", Строка.Ключ, Строка.Значение)
			);
		КонецЦикла;
		
		ПредставлениеЗначенияНастройки = СтрСоединить(ЧастиПредставления, "; ");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбновлятьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры
