
#Область ПрограммныйИнтерфейс

Функция МодульПрикладнойЛогикиИнтеграции() Экспорт
	
	Возврат рдв_ИнтеграцияДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиОчередей() Экспорт
	
	Возврат рдв_РаботаСОчередямиДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиФормированияХешей() Экспорт
	
	Возврат рдв_ФормированиеХешейОбъектовДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиМенеджераОбмена() Экспорт
	
	Возврат рдв_МенеджерОбменаДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиРегистрацииИзменений() Экспорт
	
	Возврат рдв_РегистрацияИзмененийДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиОбработчиковСобытий() Экспорт
	
	Возврат рдв_ОбработчикиСобытийДемо;
	
КонецФункции

Функция МодульПрикладнойЛогикиМониторингаДанных() Экспорт
	
	Возврат рдв_МониторингДанныхДемо;
	
КонецФункции

#КонецОбласти
