
#Область ПрограммныйИнтерфейс

Функция ИмяМодуляБизнесЛогикиИнтеграции() Экспорт
	
	ИмяМодуля = "рдв_МодульИнтеграцииДемо";
	Возврат ИмяМодуля;
	
КонецФункции

Функция ИмяМодуляБизнесЛогикиОчередей() Экспорт
	
	ИмяМодуля = "рдв_РаботаСОчередямиДемо";
	Возврат ИмяМодуля;
	
КонецФункции

Функция ИмяМодуляБизнесЛогикиФормированияХешей() Экспорт
	
	ИмяМодуля = "рдв_ФормированиеХешейОбъектовДемо";
	Возврат ИмяМодуля;
	
КонецФункции

// Предоставляет общий модуль для выполнения операций конкретной интеграции
// Определяет тип внешней системы (HTTP сервис или RMQ и прочее)
//
// Параметры:
//  ТипВнешнейСистемы - ПеречислениеСсылка.рдв_ТипыВнешнихСистем - тип интеграции
//  ИдентификаторСообщения - Неопределено, Строка - Идентификатор конкретного сообщения для отправки
//
// Возвращаемое значение:
//   Неопределено - 
//   ОбщийМодуль - модуль интеграции
//
Функция МодульРаботыСВнешнейСистемойПоТипу(ТипВнешнейСистемы) Экспорт

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
