
#Область ПрограммныйИнтерфейс

// Для внутреннеого использования.
Функция ДобавитьВОчередь(Знач ТипОчереди, 
	Объект, 
	Параметры, 
	РазделительПотока, 
	ПроверятьОбъектВОчереди,
	ОписаниеСостояния,
	ДатаНачалаОбработкиUTC) Экспорт
	
	// Для перехода в контекст сервера для установки привилегированного режима.
	
	Возврат рдв_РаботаСОчередями.ДобавитьВОчередь(
		ТипОчереди,
		Объект,
		Параметры,
		РазделительПотока,
		ПроверятьОбъектВОчереди,
		ОписаниеСостояния,
		ДатаНачалаОбработкиUTC
	);

КонецФункции

#КонецОбласти
