
#Область ПрограммныйИнтерфейс

Функция ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета) Экспорт
	
	Имя = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиФормированияХешей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	
	Модуль.ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета);
	
КонецФункции
  
Функция ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей) Экспорт
	
	Имя = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиФормированияХешей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	
	Модуль.ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей);
	
КонецФункции

Функция ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша) Экспорт
	
	Имя = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиФормированияХешей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	
	Модуль.ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша);
	
КонецФункции

#КонецОбласти
