
#Область ПрограммныйИнтерфейс

Функция ИмяМодуляБизнесЛогикиФормированияХеша() Экспорт

	Возврат "рдв_ФормированиеХешейОбъектовДемо";

КонецФункции

Функция ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета) Экспорт
	
	Имя = ИмяМодуляБизнесЛогикиФормированияХеша();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	Модуль.ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета);
	
КонецФункции
  
Функция ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей) Экспорт
	
	Имя = ИмяМодуляБизнесЛогикиФормированияХеша();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	Модуль.ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей);
	
КонецФункции

Функция ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша) Экспорт
	
	Имя = ИмяМодуляБизнесЛогикиФормированияХеша();
	Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	Модуль.ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша);
	
КонецФункции

#КонецОбласти
