
#Область ПрограммныйИнтерфейс

Функция ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета) Экспорт
	
	Модуль().ПравилаРасчетаХеша(ОбъектОчереди, ПравилоКонвертации, ПравилаДляРасчета);
	
КонецФункции
  
Функция ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей) Экспорт
	
	Модуль().ХешРассчитать(ОбъектОчереди, ПравилаРасчетаХеша, ТаблицаХешей);
	
КонецФункции

Функция ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша) Экспорт
	
	Модуль().ИнициализироватьПравилаРасчетаХеша(ПравилаРасчетаХеша);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Модуль()
	
	Модуль = рдв_ФормированиеХешейОбъектов.МодульПрикладнойЛогики();
	
	Возврат Модуль;
	
КонецФункции

#КонецОбласти
