#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусПоИмени(Имя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рдв_СтатусыИнтеграции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.рдв_СтатусыИнтеграции КАК рдв_СтатусыИнтеграции
		|ГДЕ
		|	рдв_СтатусыИнтеграции.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ВРег(Имя));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.рдв_СтатусыИнтеграции.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли