#Область ПрограммныйИнтерфейс


// Переопределяет получение метода по имени.
// 
// Параметры:
//  МодульМенеджера -  - 
//  ИмяПредопределенного - Строка - 
// 
// Возвращаемое значение:
//  Произвольный
Функция Элемент(МодульМенеджера, ИмяПредопределенного) Экспорт
	
	
	
КонецФункции

// Для рефакторинга и изменения имени существующего предопределенного элемента
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - текущий обрабатываемый объект метаданных
// Пример:
//
//	Если ОбъектМетаданных = Метаданные.Справочники.рдв_ВашСправочник Тогда
//		
//		Элемент = рдв_ПредопределенныеДанные.Элемент(ОбъектМетаданных, "ЗначениеДляЗамены", Ложь);
//		
//		Если Элемент = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//		
//		ЭлементОбъект = Элемент.ПолучитьОбъект();
//		ЭлементОбъект.Идентификатор = "НовоеПредопределенноеИмя";
//		ЭлементОбъект.Наименование = "Новое имя";
//		ЭлементОбъект.Записать();
//		
//	КонецЕсли;
// 
Процедура ИзменитьИмяПредопределенного(ОбъектМетаданных) Экспорт
	
КонецПроцедуры

#КонецОбласти
