#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокОчередей(СписокОчередей) Экспорт
	
	рдв_РаботаСОчередямиДемо.ЗаполнитьСписокОчередей(СписокОчередей);
	
КонецПроцедуры

Процедура ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект) Экспорт
	
	рдв_РаботаСОчередямиДемо.ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки) Экспорт
	
	рдв_РаботаСОчередямиДемо.ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки);
	
КонецПроцедуры

#КонецОбласти