#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокОчередей(СписокОчередей) Экспорт
	
	ИмяМодуля = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиОчередей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Модуль.ЗаполнитьСписокОчередей(СписокОчередей);
	
КонецПроцедуры

Процедура ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект) Экспорт
	
	ИмяМодуля = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиОчередей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Модуль.ЗаполнитьТипОчередиПоУмолчанию(ИмяОчереди, ТипОчередиОбъект);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки) Экспорт
	
	ИмяМодуля = рдв_ИнтеграцияПереопределяемый.ИмяМодуляБизнесЛогикиОчередей();
	Модуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	
	Модуль.ВыполнитьОбработкуОчереди(ИмяОчереди, ИдентификаторыОчереди, РезультатОбработки);
	
КонецПроцедуры

#КонецОбласти