
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОчереди(Команда)
	ТипыОчередей = Элементы.Список.ВыделенныеСтроки;
	Если ТипыОчередей.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выделены строки для обработки.");
		Возврат;
	КонецЕсли;
	ОбработатьОчередиНаСервере(ТипыОчередей);
	ПоказатьПредупреждение(, "Обработка данных очередей завершена.");
КонецПроцедуры

&НаСервере
Процедура ОбработатьОчередиНаСервере(Знач ТипыОчередей)
	Для Каждого ТипОчереди Из ТипыОчередей Цикл
		рдв_РаботаСОчередями.ВыполнитьОбработкуОчереди(ТипОчереди);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТипыОчередейНаСервере()

	Справочники.рдв_ТипыОчередейОбработкиДанных.ИнициализироватьТипыОчередей();

КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьТипыОчередей(Команда)
	ИнициализироватьТипыОчередейНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
