#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
//	Если Количество() = 0 Тогда
//		ПолноеУдаление = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ПолноеУдаление", Ложь);
//		Если Не ПолноеУдаление Тогда
//			
//			ОтборУстановлен = Не Отбор.Найти("ИдентификаторСообщения") = Неопределено;
//			
//			Если Не ОтборУстановлен Тогда
//				Возврат;
//			КонецЕсли;
//			
//			ИдентификаторСообщения = Отбор.ИдентификаторСообщения.Значение;
//			
//			Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
//			
//				РегистрыСведений.рдв_СообщенияИнтеграции.СообщениеКонтекстУдалить(ИдентификаторСообщения);
//				РегистрыСведений.рдв_СообщенияИнтеграции.СообщениеОбъектыУдалить(ИдентификаторСообщения);
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

