
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	Данные = ВнешнийНаборДанныхПравилРегистрации();
	ВнешнийНабор = Новый Структура;
	ВнешнийНабор.Вставить("Правила", Данные);
	
	//Инициализируем процессор компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНабор, ДанныеРасшифровки, Истина);
	
	//Очищаем документ результата
	ДокументРезультат.Очистить();
	
	//Выводим отчет в документ
	ПроцессорВывода = Новый
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВнешнийНаборДанныхПравилРегистрации()
	
	Правила = рдв_РегистрацияИмененийПовтИсп.ИнициализироватьПравилаРегистрации();
	
	ПравилаРегистрации = Правила.СкопироватьКолонки("ВнешняяСистема,АдресМетода");
	ПравилаРегистрации.Колонки.Добавить("МетаданныеОбъекта");
	ПравилаРегистрации.Колонки.Добавить("КлассОбъекта");
	Для Каждого Правило Из Правила Цикл
		НоваяСтрока = ПравилаРегистрации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Правило, , "МетаданныеОбъекта");
		НоваяСтрока.МетаданныеОбъекта = Правило.МетаданныеОбъекта.ПолноеИмя();
		НоваяСтрока.КлассОбъекта = СтрРазделить(НоваяСтрока.МетаданныеОбъекта, ".")[0];
	КонецЦикла;
	
	Возврат ПравилаРегистрации;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
