#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидСообщения(Интерфейс, ИмяВидаСообщения) Экспорт
	
	Если Не ЗначениеЗаполнено(Интерфейс) Или ПустаяСтрока(ИмяВидаСообщения) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	НайденныйВидЗапроса = НайтиПоРеквизиту("ИмяВидаСообщения", ИмяВидаСообщения,, Интерфейс);
	Если ЗначениеЗаполнено(НайденныйВидЗапроса) Тогда
		Возврат НайденныйВидЗапроса;
	КонецЕсли;
	
	НовыйВидЗапроса = СоздатьЭлемент();
	НовыйВидЗапроса.Наименование = ИмяВидаСообщения;
	НовыйВидЗапроса.ИмяВидаСообщения = ИмяВидаСообщения;
	НовыйВидЗапроса.Владелец = Интерфейс;
	НовыйВидЗапроса.ЗаписыватьДанныеСообщений = Истина;
	НовыйВидЗапроса.УстановитьНовыйКод();
	НовыйВидЗапроса.Записать();
	
	Возврат НовыйВидЗапроса.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
