
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	рдв_НастройкиПрограммы.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
 		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	рдв_НастройкиПрограммы.ПередИнтерактивнойЗаписюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	рдв_НастройкиПрограммы.ПриИнтерактивнойЗаписиНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	рдв_НастройкиПрограммы.ПослеИнтерактивнойЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидЗначенияПриИзменении(Элемент)

	УстановитьДоступностьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцеудурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВидимостьЭлементов(Форма)

	Элементы = Форма.Элементы;

	ИмяВидаСоответствие 	= "Перечисление.рдв_ВидыЗначенийНастроек.Соответствие";
	ВидЗначенияСоответствие	= ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ИмяВидаСоответствие);

	ЭтоСоответствиеЗначений = Форма.Объект.ВидЗначения = ВидЗначенияСоответствие;
	
	ИмяВидаСписокЗначений 		= "Перечисление.рдв_ВидыЗначенийНастроек.СписокЗначений";
	ВидЗначенияСписокЗначений	= ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(ИмяВидаСписокЗначений);
	
	ЭтоСписокЗначений = Форма.Объект.ВидЗначения = ВидЗначенияСписокЗначений;
	
	Элементы.Значение.Видимость 			= Не ЭтоСоответствиеЗначений И Не ЭтоСписокЗначений;
	Элементы.Значения.Видимость				= ЭтоСписокЗначений;
	
	Элементы.СоответствиеЗначений.Видимость = ЭтоСоответствиеЗначений;
	Элементы.ТипКлюча.Видимость				= ЭтоСоответствиеЗначений;
	
КонецПроцедуры  

#КонецОбласти
